% Apple by Example
% Vanessa McHale

# Introduction

Apple is an experimental compiler with a working though not-perfectly-designed
typed frontend.

## Installation

The REPL and typechecker are available on the [release page](https://github.com/vmchale/apple/releases).

### Libraries

To install the libraries, you can use [ghcup](https://www.haskell.org/ghcup/) to install cabal and GHC.

Then:

```
make
sudo make install-lib
```

To install the Python extension module:

```
make install-py
```

## Reference Card

In the REPL, type `\l`.

```
 > \l
Î›             scan                     âˆš             sqrt
â‹‰             max                      â‹Š             min
â³             integer range            âŒŠ             floor
â„¯             exp                      â¨³ {m,n}       convolve
\~            successive application   \`n           dyadic infix
_.            log                      'n            map
`             zip                      `{i,jâˆ˜[k,l]}  rank
ğ’»             range (real)             ğœ‹             pi

â‹®
```

Use `:ty` for more:

```
 > :ty (âŠ²)
a â†’ Vec i a â†’ Vec (i + 1) a
```

## Editor Plugins

There is a [vim plugin](https://github.com/vmchale/apple/tree/canon/vim) and a
[VSCode extension](https://marketplace.visualstudio.com/items?itemName=vmchale.apple).

The file extension is `.ğŸ` or `.ğŸ`.

# Capabilities

## Integer Range

To generate an integer range use `irange` or `â³` (APL iota).

```
 > â³
â³ : int â†’ int â†’ int â†’ Vec #n int
```

`â³` takes a start value, end value, and step size as arguments, viz.

```
 > â³ 0 9 1
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
 > irange 30 0 _3
[30, 27, 24, 21, 18, 15, 12, 9, 6, 3, 0]
```

Note that `_` is used for negative literals.

## Real Range

For a range of real numbers, use `frange` or `ğ’»`.

```
 > :ty frange
float â†’ float â†’ int â†’ Vec #n float
```

`frange` takes a start value, an end value, and the number of steps.

```
 > frange 0 9 10
[0.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0]
```

## Map

`'` maps over an array.

```
 > (*2)'â³ 0 9 1
[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]
```

Functions can be [curried](https://wiki.haskell.org/Currying).

## Fold

`/` folds over an array.

```
 > (+)/â³ 1 100 1
5050
```

## Array Literals

Array literals are delineated by `âŸ¨`...`âŸ©`.

```
 > âŸ¨_1,0::intâŸ©
[-1, 0]
```

```
 > âŸ¨âŸ¨0,1âŸ©,âŸ¨_1,0::intâŸ©âŸ©
[ [0, 1]
, [-1, 0] ]
```

## Reverse

`~` reverses an array.

```
 > ~(irange 0 9 1)
[9, 8, 7, 6, 5, 4, 3, 2, 1, 0]
```

Reverse applied to a higher-dimensional array reverses elements (sub-arrays) along the first dimension.

```
 > âŸ¨âŸ¨0,1âŸ©,âŸ¨1,0::intâŸ©,âŸ¨2,4âŸ©âŸ©
[ [0, 1]
, [1, 0]
, [2, 4] ]
 > ~âŸ¨âŸ¨0,1âŸ©,âŸ¨1,0::intâŸ©,âŸ¨2,4âŸ©âŸ©
[ [2, 4]
, [1, 0]
, [0, 1] ]
```

```
 > ~'âŸ¨âŸ¨0,1âŸ©,âŸ¨1,0::intâŸ©,âŸ¨2,4âŸ©âŸ©
[ [1, 0]
, [0, 1]
, [4, 2] ]
```

## Outer Product

The outer product `âŠ—` creates a table by applying some function.

```
 > :ty \f.\x.\y. x fâŠ— y
(a â†’ b â†’ c) â†’ Arr sh0 a â†’ Arr sh1 b â†’ Arr (sh0 â§º sh1) c
```

```
 > (frange 0 9 10) (*)âŠ— (frange 0 9 10)
[ [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]
, [0.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0]
, [0.0, 2.0, 4.0, 6.0, 8.0, 10.0, 12.0, 14.0, 16.0, 18.0]
, [0.0, 3.0, 6.0, 9.0, 12.0, 15.0, 18.0, 21.0, 24.0, 27.0]
, [0.0, 4.0, 8.0, 12.0, 16.0, 20.0, 24.0, 28.0, 32.0, 36.0]
, [0.0, 5.0, 10.0, 15.0, 20.0, 25.0, 30.0, 35.0, 40.0, 45.0]
, [0.0, 6.0, 12.0, 18.0, 24.0, 30.0, 36.0, 42.0, 48.0, 54.0]
, [0.0, 7.0, 14.0, 21.0, 28.0, 35.0, 42.0, 49.0, 56.0, 63.0]
, [0.0, 8.0, 16.0, 24.0, 32.0, 40.0, 48.0, 56.0, 64.0, 72.0]
, [0.0, 9.0, 18.0, 27.0, 36.0, 45.0, 54.0, 63.0, 72.0, 81.0] ]
```

```
 > (frange 0 4 5) [(x,y)]âŠ— (frange 0 4 5)
[ [(0.0*0.0), (0.0*1.0), (0.0*2.0), (0.0*3.0), (0.0*4.0)]
, [(1.0*0.0), (1.0*1.0), (1.0*2.0), (1.0*3.0), (1.0*4.0)]
, [(2.0*0.0), (2.0*1.0), (2.0*2.0), (2.0*3.0), (2.0*4.0)]
, [(3.0*0.0), (3.0*1.0), (3.0*2.0), (3.0*3.0), (3.0*4.0)]
, [(4.0*0.0), (4.0*1.0), (4.0*2.0), (4.0*3.0), (4.0*4.0)] ]
```

## Successive Application

```
 > :ty (\~)
(a â†’ a â†’ b) â†’ Arr (i + 1 `Cons` sh) a â†’ Arr (i `Cons` sh) b
```

`[(-)\~ x]` gives successive differences.

```
 > (-)\~ ((^2)'(frange 0 9 10))
[1.0, 3.0, 5.0, 7.0, 9.0, 11.0, 13.0, 15.0, 17.0]
```

## Rotate

```
 > (âŠ–)
(âŠ–) : int â†’ Vec i a â†’ Vec i a
```

```
 > 2 âŠ– irange 0 9 1
[2, 3, 4, 5, 6, 7, 8, 9, 0, 1]
 > _2 âŠ– irange 0 9 1
[8, 9, 0, 1, 2, 3, 4, 5, 6, 7]
```

## Cycle

`cyc.` or `âŠ™` (infix) concatenates an array with itself a specified number of times.

```
 > cyc. âŸ¨0::int,1âŸ© 4
Vec 8 [0, 1, 0, 1, 0, 1, 0, 1]
```

```
 > âŸ¨0::int,1âŸ©âŠ™4
Vec 8 [0, 1, 0, 1, 0, 1, 0, 1]
```

## Transpose

â‰ or `|:`

```
 > â‰ âŸ¨âŸ¨1.0,3âŸ©,âŸ¨4,4âŸ©,âŸ¨2,_2âŸ©âŸ©
[ [1.0, 4.0, 2.0]
, [3.0, 4.0, -2.0] ]
 > âŸ¨âŸ¨1.0,3âŸ©,âŸ¨4,4âŸ©,âŸ¨2,_2âŸ©âŸ©
[ [1.0, 3.0]
, [4.0, 4.0]
, [2.0, -2.0] ]
```

## Unfold

```
 > gen. (1::int) (*2) 10
Vec 10 [1, 2, 4, 8, 16, 32, 64, 128, 256, 512]
```

## Dyadic Infix

Moving average:

```
 > [((+)/x)%â„(:x)]\` 7 (frange 0 9 10)
[3.0, 4.0, 5.0, 6.0]
```

```
 > [x]\`4 (frange 0 5 6)
[ [0.0, 1.0, 2.0, 3.0]
, [1.0, 2.0, 3.0, 4.0]
, [2.0, 3.0, 4.0, 5.0] ]
```

## Bind

```
 > {iâ†2::int;i*i}
4
```

Bind, preventing inlining:

```
 > {iâŸœ2::int;i*i}
4
```

One can see that `2` is stored in a register by inspecting the generated
assembly:

```
 > :asm {iâ†2::int;i*i}

    mov x0, #0x4
    ret
 > :asm {iâŸœ2::int;i*i}

    mov x0, #0x2
    mul x0, x0, x0
    ret
```

### Polymorphic Bind

```
 > {sum â‡ [(+)/x]; sum (irange 0 9 1)+âŒŠ(sum(frange 0 9 10))}
90
```

```
 > {sum â† [(+)/x]; sum (irange 0 9 1)+âŒŠ(sum(frange 0 9 10))}
1:42: could not unify 'float' with 'int' in expression 'ğ’» 0 9 10'
```

## Rank

Rank ```{i,jâˆ˜[k,l]}`` lifts a function to operate on i, j-cells, optionally
specifying axes k,l. Iteration is bottom-up; by contrast map `'` cuts across the leading
dimension.

To make a scalar function apply to arrays, re-rank

```
 > :ty ((*)`{0,0})
(IsNum c) :=> Arr sh c â†’ Arr sh c â†’ Arr sh c
```

Sigmoid on an arbitrary-dimension array:

```
([1%(1+â„¯(_x))]`{0})
```

```
 > âŸ¨âŸ¨0,1,2âŸ©,âŸ¨3,4,5::intâŸ©âŸ©
Arr (2Ã—3) [ [0, 1, 2]
          , [3, 4, 5] ]
 > {sumâ†[(+)/x]; sum`{1} âŸ¨âŸ¨0,1,2âŸ©,âŸ¨3,4,5::intâŸ©âŸ©}
Vec 3 [3, 5, 7]
 > {sumâ†[(+)/x]; sum`{1âˆ˜[2]} âŸ¨âŸ¨0,1,2âŸ©,âŸ¨3,4,5::intâŸ©âŸ©}
Vec 2 [3, 12]
```

Take 0-cells (scalars) from the first array and 1-cells from the second,

```
 > (âŠ²)`{0,1âˆ˜[2]} âŸ¨0::int,1âŸ© âŸ¨âŸ¨2,3âŸ©,âŸ¨4,5âŸ©âŸ©
Arr (2Ã—3) [ [0, 2, 3]
          , [1, 4, 5] ]
```

```
 > :ty [â™­`{3âˆ˜[2,3,4]} (x :: Arr (60000 Ã— 28 Ã— 28 Ã— 1) float)]
Arr (60000 Ã— 28 Ã— 28 Ã— 1) float â†’ Arr (60000 Ã— 784) float
```

## REPL Functionality

### Benchmark

```
 > :bench frange 0 999 1000
benchmarking...
time                 1.423 Î¼s   (1.417 Î¼s .. 1.427 Î¼s)
                     1.000 RÂ²   (1.000 RÂ² .. 1.000 RÂ²)
mean                 1.426 Î¼s   (1.422 Î¼s .. 1.429 Î¼s)
std dev              11.94 ns   (9.819 ns .. 14.22 ns)
```

### QuickCheck

Apple can generate shape-correct test cases for property testing. For instance,

```
 > :qc \x. [(+)/(*)`x y] x x >= 0.0
Passed, 100.
```

tests that the dot product of a vector with itself is nonnegative.

## Exotic Syntax

### Coronis

Instead of

```
{xâ†y;z}
```

One can write

```
â¸xâ†y;z
```

Using the [typographical coronis](https://en.wikipedia.org/wiki/Coronis_(textual_symbol)).

### Matrix Dimensions

One can specify matrix dimensions in a type signature with unicode subscript
digits separated by a comma.

```
(ğ”¯ 0 1) :: M â‚â‚‚,â‚â‚‚ float
```

is equivalent to

```
(ğ”¯ 0 1) :: Arr (12 Ã— 12) float
```

### Identity Matrix

ğŸ‘ï¸ can be used in place of `eye.` for the identity matrix.

# Examples

## Dot Product

```
[(+)/ ((*)`(x::Vec n float) y)]
```

`/` is fold and ` is zip. Note that we must provide a type annotation

We can inspect the assembly:

```
 > :asm [(+)/ ((*)`(x::Vec n float) y)]

    ldr x4, [x0, #0x8]
    ldr d3, [x0, #0x10]
    ldr d2, [x1, #0x10]
    fmul d0, d3, d2
    mov x2, #0x1
    cmp x2, x4
    b.GE apple_1
apple_0:
    add x3, x2, #0x2
    ldr d3, [x0, x3, LSL #3]
    add x3, x2, #0x2
    ldr d2, [x1, x3, LSL #3]
    fmadd d0, d3, d2, d0
    add x2, x2, #0x1
    cmp x2, x4
    b.LT apple_0
apple_1:
    ret
```

## Rising Factorial

The [rising factorial](https://mathworld.wolfram.com/RisingFactorial.html) is defined as:

$$ x^{(n)} = x(x+1)\cdots (x+n-1)$$

In apple this is

```
[(*)/â‚’ 1 (â³ x (x+y-1) 1)]
```

`/â‚’` is a ternary operator, fold with seed.

## Kullback-Leibler Divergence

```
Î»p.Î»q. (+)/([x*_.(x%y)]`p q)
```

## Shoelace Theorem

```
Î»as.Î»bs.
    { sum â‡ [(+)/x]
    ; 0.5*abs.(sum((*)`as (1âŠ–bs)) - sum((*)`(1âŠ–as) bs))
    }
```

## Polynomials

### Evaluation

```
Î»p.Î»x. (+)/ ((*)`(~p) (gen. 1 (*x) (ğ“‰p)))
```

## Array

To take all but the last 6 elements:

```
[{.\`7 x]
```

To drop the first 6 elements:

```
[}.\`7 x]
```

### Matrix-Vector Multiplication

```
Î»A.Î»x.
{
  dot â‡ [(+)/((*)`x y)];
  (dot x)`{1âˆ˜[2]} (A::Arr (i Ã— j) float)
}
```

### Filter

```
\p.\xs. (xsË™)'pâ©ªxs
```

## Functional Programming

[any](https://hackage.haskell.org/package/base/docs/Prelude.html#v:any)

```
\p.\xs. (âˆ¨)/â‚’ #f (p'xs)
```

## [Luhn Check](https://en.wikipedia.org/wiki/Luhn_algorithm)

```
Î»xs.
  { digitSum â† [?x>10,.x-9,.x]
  ; t â† (+)/ [digitSum (x*y)]`(~(}:xs)) (}: (cyc. âŸ¨2,1::intâŸ© 8))
  ; 10-(t|10)=}.xs
  }
```

## Numerics

### Arithmetic-Geometric Mean

```
Î»x.Î»y.([{aâŸœx->1;gâŸœx->2;((a+g)%2,âˆš(a*g))}]^:6 (x,y))->1
```

Thence to compute the [complete elliptic integral of the first kind](https://en.wikipedia.org/wiki/Elliptic_integral#Complete_elliptic_integral_of_the_first_kind):

```
Î»k.
{
  agm â† Î»x.Î»y.([{aâŸœx->1;gâŸœx->2;((a+g)%2,âˆš(a*g))}]^:6 (x,y))->1;
  ğœ‹%(2*agm 1 (âˆš(1-k^2)))
}
```

To compute the logarithm, turn to Gauss:

```
Î»m.Î»x.
{
  amgm â† Î»x.Î»y.([{aâŸœx->1;gâŸœx->2;((a+g)%2,âˆš(a*g))}]^:15 (x,y))->1;
  -- m>2
  ğœ‹%(2*amgm 1 (0.5^(m-2)%x))-â„ m*0.6931471805599453
}
```

```
 > :yank log math/log.ğŸ
 > log 128 9
2.1972245773362147
 > _.9
2.1972245773362196
```

### Hypergeometric Function

$$ {}_pF_q(a_1,\ldots,a_p;b_1,\ldots,b_q;x) = \sum_{n=0}^\infty \frac{(a_1)_n\ldots (a_p)_n}{(b_1)_n\ldots (b_q)_n}\frac{x^n}{n!}$$

where $(x)_n$ is the [rising factorial](#rising-factorial) above.

```
Î»a.Î»b.Î»z.
{
  rf â† [(*)/â‚’ 1 (ğ’» x (x+y-1) (âŒŠy))]; fact â† rf 1;
  Î£ â† Î»N.Î»a. (+)/â‚’ 0 (a'(â³ 0 N 1)); Î  â‡ [(*)/x];
  Î£ 30 (Î»n. {nnâŸœâ„ n; (Î  ((Î»a.rf a nn)'a)%Î ((Î»b. rf b nn)'b))*(z^n%fact nn)})
}
```

We can use the REPL to inspect the type:

```
 > :yank H math/hypergeometric.ğŸ
 > :ty H
Vec (i + 1) float â†’ Vec (i + 1) float â†’ float â†’ float
```

## Geography

### Mercator

$$ x \mapsto \lambda - \lambda_0 $$
$$ y \mapsto \frac{1}{2} \log{\left(\frac{1+\sin \phi}{1-\sin \phi}\right)} $$

```
\ğœ†â‚€.\ğœ‘.\ğœ†.{aâŸœsin.ğœ‘;(ğœ†-ğœ†â‚€,(_.((1+a)%(1-a)))%2)}
```

### [Albers](https://mathworld.wolfram.com/AlbersEqual-AreaConicProjection.html)

Let ğœ†â‚€, ğœ‘â‚€ be the coÃ¶rdinates of the origin, ğœ‘â‚, ğœ‘â‚‚ standard parallels, `Ï†s` and `lambdas` the longitudes and latitudes, respectively.

```
\ğœ†â‚€.\ğœ‘â‚€.\ğœ‘â‚.\ğœ‘â‚‚.\Ï†s.\lambdas.
{
  ğ‘› âŸœ (sin. ğœ‘â‚+sin.ğœ‘â‚‚)%2;
  ğ¶ âŸœ (cos. ğœ‘â‚)^2+2*ğ‘›*sin. ğœ‘â‚;
  ğœŒâ‚€ âŸœ âˆš(ğ¶-2*ğ‘›*sin. ğœ‘â‚€)%ğ‘›;
  albers â† \ğœ‘.\ğœ†.
    {
      ğœƒ âŸœ ğ‘›*(ğœ†-ğœ†â‚€);
      ğœŒ âŸœ âˆš(ğ¶-2*ğ‘›*sin. ğœ‘)%ğ‘›;
      (ğœŒ*sin. ğœƒ, ğœŒâ‚€-ğœŒ*cos. ğœƒ)
    };
  albers`Ï†s lambdas
}
```

## Number Theory

### Primality Check

```
Î»n.Â¬((âˆ¨)/â‚’ #f ([(n|x)=0]'(â³ 2 (âŒŠ(âˆš(â„n))) 1)))
```

### Radical

Compute the radical of an integer $n$, $\displaystyle \prod_{p|n} p$

```
Î»n.
  { ni âŸœ âŒŠ(âˆš(â„n))
  ; isPrime â† Î»n.Â¬((âˆ¨)/â‚’ #f ([(n|x)=0]'(â³ 2 (âŒŠ(âˆš(â„n))) 1)))
  ; pf â‡ (isPrime #.)
  ; pps âŸœ  pf ((Î»k. ((n|k)=0)) #. (â³ 2 ni 1))
  ; ?ni^2=n
    ,.((*)/â‚’ 1 (pf ((n/.)'(}:? pps))â§ºpps))
    ,.((*)/â‚’ 1 (pf (n âŠ² ((n/.)'pps))â§ºpps))
  }
```

## Python Extension Module

### Sample Normal Distribution

To generate normally distributed random values, we can use

$$ X = \sqrt{-2 \log B_1} \cos (2\pi B_2) $$

where $B_1$, $B_2$ are uniformly distributed $\in [0,1)$.

Debugging randomness is fraught, so we turn to Python's visualization
libraries.

```{.include}
nb/hist.html
```

### Image Processing

`([((+)/* 0 (x::Arr (7 Ã— 7) float))%â„(:x)] â¨³ {7,7})` applies a 7x7 mean filter to a
2-dimensional array.

We can use [Pillow](https://python-pillow.org/) to apply it to an image:

```{.include}
nb/convolve.html
```

### Random Walks

Cliff Reiter points out that we can simulate a random walk by simply scanning an array of random values, viz.

```
(+)Î› ((ğ”¯ _1 1) :: Vec 200 int)
```

```{.include}
nb/randomWalk.html
```
